public class HW3 {

//    void main() {
//        Задача №1
//
//        Необходимо создать две целочисленные переменные (a, b), присвоить произвольные значения переменным на ваш выбор
//        и вывести следующие строки:
//        a == b - если переменные равны
//        a < b - если переменная a меньше b
//        a > b - если переменная b меньше a
//    void main() {
//        int a = 5;
//        int b = 10;
//        if (a == b) {
//            IO.println("a == b");
//        } else if (a < b) {
//            IO.println("a < b");
//        } else {
//            IO.println("a > b");
//        }


//        Задача №2
//
//        Необходимо создать две целочисленные переменные (a, b), присвоить произвольные значения переменным на ваш выбор и
//        вывести следующие строки:
//        maybe a and b are even - если сумма переменных четная
//        some variable is odd - если сумма переменных нечетная
//

    //    void main() {
//        int a = 5;
//        int b = 11;
//        if ( (a + b) % 2 == 0) {
//            IO.println("maybe a and b are even");
//        } else {
//            IO.println("some variable is odd");
//        }
//
//        Задача №3
//
//        Необходимо создать целочисленную переменную, присвоить произвольное значение переменной на ваш выбор и вывести следующие строки:
//        больше 10 - если переменная больше 10
//        меньше 100 - если переменная меньше 100
//        результат деления на 2 больше 20 - если это соответствует истине
//        значение переменной между 5 и 40 включительно - если это правда
//        значение переменной меньше 5 или больше 40 - если предыдущие условие ложное
    void main() {
        int a = 10;
        if (a > 10) {
            IO.println("больше 10");
        }
        if (a < 100) {
            IO.println("меньше 100");
        }
        if (a / 2 > 20) {
            IO.println("результат деления на 2 больше 20");
        }
        if (a >= 5 && a <= 40) {
            IO.println("значение переменной между 5 и 40 включительно");
        } else {
            IO.println("значение переменной меньше 5 или больше 40");
        }

    }
}
