public class HW6_1 {
    //    Задача №1
//    Дан массив:
//    int[][] array = {{1, 2, 3, 4, 5}, {6, 7, 8, 9}, {-1, -2, -3, -4}, {-5, -6}};
//    необходимо вывести сумму элементов массива.
//    void main() {
//        int[][] array = {{1, 2, 3, 4, 5}, {6, 7, 8, 9}, {-1, -2, -3, -4}, {-5, -6}};
//        int sum = 0;
//        for (int i = 0; i < array.length; i++) {
//            for (int j = 0; j < array[i].length; j++) {
//                sum += array[i][j];
//            }
//        }
//        IO.println("Сумма элементов массива: " + sum);
//    }


//            Задача №2
//    Дан массив:
//    int[][] array = {{1, 2, 3, 4, 5}, {6, 7, 8, 9}, {-1, -2, -3, -4}, {-5, -6}};
//    необходимо вывести максимальное значение массива.
//    void main(){
//        int[][] array = {{1, 2, 3, 4, 5}, {6, 7, 8, 9}, {-1, -2, -3, -4}, {-5, -6}};
//        int maxValue = Integer.MIN_VALUE;
//        for (int i = 0; i < array.length; i++) {
//            for (int j = 0; j < array[i].length; j++) {
//                if (array[i][j] > maxValue) {
//                    maxValue = array[i][j];
//                }
//            }
//        }
//        IO.println("Максимальное значение массива: " + maxValue);
//    }


    //            Задача №3
//    Дан массив:
//    int[][] array = {{1, 2, 3, 4, 5}, {6, 7, 8, 9}, {-1, -2, -3, -4}, {-5, -6}};
//    необходимо вывести количество элементов в массиве.
//    void main() {
//        int[][] array = {{1, 2, 3, 4, 5}, {6, 7, 8, 9}, {-1, -2, -3, -4}, {-5, -6}};
//        int count = 0;
//        for (int i = 0; i < array.length; i++) {
//            count += array[i].length;
//        }
//        IO.println("Количество элементов в массиве: " + count);
//    }
}
