public class HW4 {
//    Задача №1
//    Необходимо вывести в консоль числа от 0 до 15.

//    void main(){
//        for (int i = 0; i <= 15; i++) {
//            IO.println(i);
//        }
//    }
//    Задача №2
//    Необходимо возводить в степень число 5 начиная с показателя 1, пока результат возведения в степень меньше 10000, вывести результат каждого возведения в степень.
//    void main(){
//        for(int i = 5; i < 10000; i *= 5) {
//            IO.println(i);
//        }
//    }
//    Задача №3
//    Необходимо вывести все числа кратные 4 между числами 40 и 60 включительно.
//            Реализовать 2 варианта:
//    использовать конструкцию if для определения кратности (цикл с шагом 1, i = i + 1);
//    без использования конструкции if (шаг цикла на ваше усмотрение).

    void main() {
        for (int i = 40; i <= 60; i++) {
            if (i % 4 == 0) {
                IO.println(i);
            }
        }
    }
//    void main(){
//        for (int i = 40; i <= 60; i += 4) {
//            IO.println(i);
//        }
//    }
}
