public class HW6_2 {
//    Задача №1
//    Дана строка:
//    String s = “Перестановочный алгоритм быстрого действия”;
//    необходимо вывести все буквы “о” из этой строки.
//    Для указанной строки ответ будет “ооооо” (или в столбик)
//    void main(){
//        String s = "Перестановочный алгоритм быстрого действия";
//        String result = "";
//        for (int i = 0; i < s.length(); i++) {
//            if (s.charAt(i) == 'о') {
//                result += s.charAt(i);
//            }
//        }
//        IO.println(result);
//    }

    //    Задача №2
//    Дана строка:
//    String s = “Перевыборы выбранного президента”;
//    необходимо подсчитать количество букв “е” в строке.
//    Для указанной строки ответ будет 4.
//    void main() {
//        String s = "Перевыборы выбранного президента";
//        int count = 0;
//
//        for (int i = 0; i < s.length(); i++) {
//            if (s.charAt(i) == 'е') {
//                count++;
//            }
//        }
//        IO.println(count);
//    }

    //    Задача №3
//    Дана строка:
//    String s = “Посмотрите как Рите нравится ритм”;
//    необходимо вывести индексы начала всех подстрок - “рит”, независимо от регистра.
//    Для указанной строки ответ будет 6, 15, 29.
//    void main() {
//        String s = "Посмотрите как Рите нравится ритм";
//        s = s.toLowerCase();
//        int index = s.indexOf("рит");
//        while (index != -1) {
//            IO.println(index);
//            index = s.indexOf("рит", index + 1);
//        }
//    }

//    Экстра задача
//    Дан массив:
//    String[][] array = {{“Привет”, “всем”, “кто”}, {“изучает”, “язык”, “программирования”}, {“java”}};
//необходимо подсчитать количество строк в массиве, которые не содержат буквы “е”.
//    void main(){
//        String[][] array = {{"Привет", "всем", "кто"}, {"изучает", "язык", "программирования"}, {"java"}};
//        int count = 0;
//        for(int i = 0; i < array.length; i++){
//            for(int j = 0; j < array[i].length; j++){
//                if(array[i][j].indexOf('е') == -1){
//                    count++;
//                }
//            }
//        }
//        IO.println(count);
//    }
}
